agency-services-transunion/src/examples/id-passcode-req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:con="https://consumerconnectws.tui.transunion.com/"
    xmlns:data="https://consumerconnectws.tui.transunion.com/data">
    <soapenv:Header/>
    <soapenv:Body>
        <con:GetAuthenticationQuestions>
            <!--Optional:-->
            <con:request>
                <!--Optional:-->
                <data:AccountCode>4pGebVt5s</data:AccountCode>
                <!--Optional:-->
                <data:AccountName>CC2PartnerTesting1</data:AccountName>
                <!--Optional:-->
                <data:RequestKey>c9673141-f0b4-43f8-be23-475a074a6044</data:RequestKey>
                <!--Optional:-->
                <data:ClientKey>Customer123456</data:ClientKey>
                <!--Optional:-->
                <data:Customer>
                    <!--Optional:-->
                    <data:CurrentAddress>
                        <!--Optional:-->
                        <data:AddressLine1>1000 JUNIPER</data:AddressLine1>
                        <!--Optional:-->
                        <data:AddressLine2 xsi:nil="true"
                            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                        <!--Optional:-->
                        <data:City>Atlanta</data:City>
                        <!--Optional:-->
                        <data:State>GA</data:State>
                        <!--Optional:-->
                        <data:Zipcode>30326</data:Zipcode>
                    </data:CurrentAddress>
                    <!--Optional:-->

                    <!--Optional:-->
                    <data:DateOfBirth>1982-08-31</data:DateOfBirth>
                    <data:FullName>
                        <!--Optional:-->
                        <data:FirstName>JACKSON</data:FirstName>
                        <!--Optional:-->
                        <data:LastName>TESTJ</data:LastName>
                        <!--Optional:-->
                        <data:MiddleName xsi:nil="true"
                            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                        <!--Optional:-->
                        <data:Prefix xsi:nil="true"
                            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                        <!--Optional:-->
                        <data:Suffix xsi:nil="true"
                            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                    </data:FullName>
                    <!--Optional:-->

                    <!--Optional:-->
                    <data:PhoneNumber>4045049006</data:PhoneNumber>
                    <data:Ssn>899010009</data:Ssn>
                </data:Customer>
                <!--Optional:-->
                <data:Email>test@gmail.com</data:Email>
                <!--Optional:-->
                <data:Language xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                <!--Optional:-->
                <data:ServiceBundleCode>CC2PartnerTesting1Authentication</data:ServiceBundleCode>
                <data:TrustSessionId>2341234-12341234-1234-1234-1234</data:TrustSessionId>
            </con:request>
        </con:GetAuthenticationQuestions>
    </soapenv:Body>
</soapenv:Envelope>